public_html/Misc/Software/SoftWare.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SoftfWare</title>
<!-- 2016-04-20 Wed 23:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">SoftfWare</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Firefox</a>
<ul>
<li><a href="#sec-1-1">vimfx</a></li>
</ul>
</li>
<li><a href="#sec-2">Dropbox</a>
<ul>
<li><a href="#sec-2-1">Why aren't certain files on one computer syncing to another</a></li>
</ul>
</li>
<li><a href="#sec-3">Ubuntu 下让sublime-text3支持中文输入法</a></li>
<li><a href="#sec-4">cartoon face</a></li>
<li><a href="#sec-5">design card</a></li>
<li><a href="#sec-6">QR code maker</a></li>
<li><a href="#sec-7">Linux下批量缩小图片</a></li>
<li><a href="#sec-8">压缩JPEG图像</a></li>
<li><a href="#sec-9">cc</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Firefox</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">vimfx</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://addons.mozilla.org/en-US/firefox/addon/vimfx/">https://addons.mozilla.org/en-US/firefox/addon/vimfx/</a>
</p>

<p>
<a href="https://github.com/akhodakivskiy/VimFx">https://github.com/akhodakivskiy/VimFx</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Dropbox</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Why aren't certain files on one computer syncing to another</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://www.dropbox.com/help/145/en">https://www.dropbox.com/help/145/en</a>
</p>

<ol class="org-ol">
<li>Check bad files:<a href="https://www.dropbox.com/bad_files_check">https://www.dropbox.com/bad_files_check</a>
</li>
<li>Incompatible characters with Windows
When naming your files, avoid characters incompatible with the
Windows file system:
<div class="org-src-container">

<pre class="src src-sh">&lt; (less than)
&gt; (greater than)
: (colon)
<span style="color: #ffa07a;">" (double quote)</span>
<span style="color: #ffa07a;">| (vertical bar or pipe)</span>
<span style="color: #ffa07a;">? (question mark)</span>
<span style="color: #ffa07a;">* (asterisk)</span>
</pre>
</div>
</li>
<li>Monitoring more than 10000 folders
The Linux version of the Dropbox desktop application is limited
from monitoring more than 10000 folders by default. Anything over
that is not watched and, therefore, ignored when syncing. 

<p>
This command will tell your system to watch up to 100000 folders.
Once the command is entered and you enter your password, Dropbox
will immediately resume syncing.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b0c4de;">echo</span> fs.inotify.max_user_watches=100000 | sudo tee -a /etc/sysctl.conf; sudo sysctl -p
</pre>
</div>
</li>
<li>Turning on extended attribute (xattr) support in Linux
Some Linux distributions have extended attributes (xattrs) turned
off by default. If you're running a Linux distribution with an ext3
or ext4 file system, it's possible to turn on xattr support,
typically through your /etc/fstab settings file. Please refer to
your Linux distribution's documentation for instructions.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Ubuntu 下让sublime-text3支持中文输入法</h2>
<div class="outline-text-2" id="text-3">
<p>
下载 <a href="./Files/sublime-imfix.c">sublime-imfix.c</a> 并保存在sublime安装的目录下
sublime<sub>text3默认安装的目录：</sub>=/opt/sublime<sub>text</sub>/=
</p>


<p>
安装C/C++的编译环境和 <code>gtk libgtk2.0-dev</code> 并编译：
</p>

<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install build-essential  
sudo apt-get install libgtk2.0-dev
gcc -shared -o libsublime-imfix.so sublime-imfix.c  <span style="color: #fa8072;">`pkg-config --libs --cflags gtk+-2.0`</span> -fPIC
</pre>
</div>

<p>
启动 Sublime Text 试一试，可以使用fcitx输入中文了
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #eedd82;">LD_PRELOAD</span>=./libsublime-imfix.so subl
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">mv libsublime-imfix.so /usr/lib
gksu gedit /usr/share/applications/sublime-text.desktop
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">change Exec=/opt/sublime_text/sublime_text %F to</span>
<span style="color: #eedd82;">Exec</span>=bash -c <span style="color: #ffa07a;">'LD_PRELOAD=/usr/lib/libsublime-imfix.so /opt/sublime_text/sublime_text'</span> %F
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">change Exec=/opt/sublime_text/sublime_text -n</span>
<span style="color: #eedd82;">Exec</span>=bash -c <span style="color: #ffa07a;">'LD_PRELOAD=/usr/lib/libsublime-imfix.so /opt/sublime_text/sublime_text'</span> -n
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">change Exec=/opt/sublime_text/sublime_text --command new_file</span>
<span style="color: #eedd82;">Exec</span>=bash -c <span style="color: #ffa07a;">'LD_PRELOAD=/usr/lib/libsublime-imfix.so /opt/sublime_text/sublime_text'</span> --command new_file
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">cartoon face</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://www.thecartoonist.me/cartoonize-deluxe/">http://www.thecartoonist.me/cartoonize-deluxe/</a>#
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">design card</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="http://www.designmantic.com/user/mydesign">http://www.designmantic.com/user/mydesign</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">QR code maker</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="http://www.qrcode-monkey.com/">http://www.qrcode-monkey.com/</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Linux下批量缩小图片</h2>
<div class="outline-text-2" id="text-7">
<p>
装上Image Magick： 
</p>

<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install imagemagick
</pre>
</div>

<ol class="org-ol">
<li>auto rename
<div class="org-src-container">

<pre class="src src-sh">convert -resize 50%x50%  photos/*.jpg   small/
</pre>
</div>
</li>
<li>the same name
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #00ffff;">for</span> img<span style="color: #00ffff;"> in</span> <span style="color: #fa8072;">`ls photos/*.JPG`</span>; <span style="color: #00ffff;">do</span> convert -resize 50%x50% $<span style="color: #eedd82;">img</span> small-$<span style="color: #eedd82;">img</span>; <span style="color: #00ffff;">done</span>
<span style="color: #00ffff;">for</span> img<span style="color: #00ffff;"> in</span> <span style="color: #fa8072;">`ls ./*.JPG`</span>; <span style="color: #00ffff;">do</span> convert -resize 25%x25% $<span style="color: #eedd82;">img</span> ./small/$<span style="color: #eedd82;">img</span>; <span style="color: #00ffff;">done</span>
</pre>
</div>
</li>
<li>More
<div class="org-src-container">

<pre class="src src-sh">image MagicK &#26159;&#19968;&#20010;&#24378;&#22823;&#30340;&#22270;&#35937;&#22788;&#29702;&#24037;&#20855;&#21253;&#12290;&#23427;&#25552;&#20379;&#20102;&#20960;&#20010;&#38750;&#24120;&#26041;&#20415;&#30340;&#21629;&#20196;&#34892;&#21629;&#20196;: display, animate,import, montage,mogrify,identify&#31561;&#65292;&#21487;&#20197;&#36827;&#34892;&#22270;&#35937;&#30340;&#26174;&#31034;&#65292;&#32553;&#25918;&#65292;&#26059;&#36716;&#65292;&#35843;&#33394;&#65292;&#21152;&#26694;&#65292;&#21152;&#27880;&#37322;&#31561;&#65292;&#36824;&#33021;&#21046;&#20316;GIF&#21160;&#30011;&#65292;&#22270;&#35937;&#32034;&#24341;&#65292;&#33021;&#33258;&#21160;&#29983;&#25104;&#22270;&#35937;.

1. &#21046;&#20316;&#32034;&#24341;&#22270;&#21644;&#21160;&#30011;

!/bin/bash
montage -bordercolor red -borderwidth 3 -label <span style="color: #ffa07a;">"%f"</span> -tile 5x3 *.JPG montage.jpg
mogrify -format gif *.JPG
display montage.jpg
animate *.JPG

2. &#32553;&#25918; convert -sample 80x40 input.jpg output.jpg <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#27880;&#24847;&#65306;&#32553;&#25918;&#21518;&#22270;&#20687;&#20445;&#25345;&#21407;&#26469;&#30340;&#38271;&#23485;&#27604;&#20363; convert -sample 25%x25% input.jpg output.jpg</span>
3. &#20026;&#24403;&#21069;&#30446;&#24405;&#30340;&#25152;&#26377;&#22270;&#20687;&#29983;&#25104;&#32553;&#30053;&#22270;

<span style="color: #00ffff;">for</span> img<span style="color: #00ffff;"> in</span> <span style="color: #fa8072;">`ls *.jpg`</span>
<span style="color: #00ffff;">do</span>
convert -sample 25%x25% $<span style="color: #eedd82;">img</span> thumb-$<span style="color: #eedd82;">img</span>
<span style="color: #00ffff;">done</span>

4. &#33719;&#21462;&#25991;&#20214;&#20449;&#24687; libtiff

tiffinfo filename.tiff
pnginfo filename.png

5. &#21487;&#20197;&#20351;&#29992; ImageMagick &#30340; identify

identify -verbose sample.png 
identify -format <span style="color: #ffa07a;">"%wx%h"</span> sample.png 

6. &#26059;&#36716;&#22270;&#20687;

convert -rotate 90 input.jpg output.jpg

7. &#26356;&#25913;&#25991;&#20214;&#31867;&#22411;

convert input.jpg output.png

8. &#20026;&#22270;&#20687;&#22686;&#21152;&#27880;&#37322;&#25991;&#23383;

convert -font helvetica -fill white -pointsize 36 <span style="color: #ffa07a;">\</span>
-draw <span style="color: #ffa07a;">'text 10,50 "Floriade 2002, Canberra, Australia"'</span> <span style="color: #ffa07a;">\</span>
floriade.jpg comment.jpg 
convert -font fonts/1900805.ttf -fill white -pointsize 36 <span style="color: #ffa07a;">\</span>
-draw <span style="color: #ffa07a;">'text 10,475 "stillhq.com"'</span> <span style="color: #ffa07a;">\</span>
floriade.jpg stillhq.jpg 

9. &#29305;&#27530;&#25928;&#26524;

convert -charcoal 2 input.jpg output.jpg <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#28845;&#31508;</span>
convert -colorize 255 input.jpg output.jpg <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#30528;&#33394; &#21487;&#20197;&#25351;&#23450;&#19977;&#31181;&#39068;&#33394; red/green/blue</span>
convert -implode 4 input.jpg output.jpg <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#20869;&#29190;&#25928;&#26524;</span>
convert -solarize 42 input.jpg output.jpg <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#26333;&#20809;&#65292;&#27169;&#25311;&#33014;&#29255;&#26333;&#20809;</span>
convert -spread 5 input.jpg output.jpg <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">&#38543;&#26426;&#31227;&#21160;&#65292;&#21442;&#25968;&#26159;&#20301;&#31227;&#22823;&#23567;</span>

10. &#19968;&#27425;&#25191;&#34892;&#22810;&#20010;&#25805;&#20316;

convert -sample 25%x25% -spread 4 -charcoal 4 input.jpg output.jpg
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">压缩JPEG图像</h2>
<div class="outline-text-2" id="text-8">
<p>
安装jpegoptim
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo apt-get install jpegoptim
</pre>
</div>
<ol class="org-ol">
<li>无损地压缩一副JPG图片
<div class="org-src-container">

<pre class="src src-sh">$ jpegoptim photo.jpg
</pre>
</div>
</li>
<li>想保护原始图片，使用"-d"参数指明保存目录
<div class="org-src-container">

<pre class="src src-sh">$ mkdir ./compressed
$ jpegoptim -d ./compressed photo.jpg
</pre>
</div>
</li>
<li>有损压缩JPG图像, 用50%质量压缩图片
<div class="org-src-container">

<pre class="src src-sh">$ jpegoptim -m50 photo.jpg
</pre>
</div>
</li>
<li>压缩多张JPEG图像
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #00ffff;">for</span> i<span style="color: #00ffff;"> in</span> *.jpg; <span style="color: #00ffff;">do</span> jpegoptim -d ./compressed -p <span style="color: #ffa07a;">"$i"</span>; <span style="color: #00ffff;">done</span>
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">cc</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>

<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>

<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-04-20 Wed 23:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
